channels_last
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1, 128, 2)         0         
_________________________________________________________________
zero_padding2d (ZeroPadding2 (None, 1, 132, 2)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 1, 132, 256)       3328      
_________________________________________________________________
dropout (Dropout)            (None, 1, 132, 256)       0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 1, 136, 256)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 1, 136, 80)        122960    
_________________________________________________________________
dropout_1 (Dropout)          (None, 1, 136, 80)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 10880)             0         
_________________________________________________________________
dense1 (Dense)               (None, 256)               2785536   
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense2 (Dense)               (None, 11)                2827      
_________________________________________________________________
activation (Activation)      (None, 11)                0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 11)                0         
=================================================================
Total params: 2,914,651
Trainable params: 2,914,651
Non-trainable params: 0
_________________________________________________________________
channels_last
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 128, 2)]          0         
_________________________________________________________________
lstm (LSTM)                  [(None, 128, 32), (None,  4480      
_________________________________________________________________
dropout_3 (Dropout)          (None, 128, 32)           0         
_________________________________________________________________
lstm_1 (LSTM)                [(None, 128, 32), (None,  8320      
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
dropout_4 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 16)                528       
_________________________________________________________________
batch_normalization_1 (Batch (None, 16)                64        
_________________________________________________________________
dropout_5 (Dropout)          (None, 16)                0         
_________________________________________________________________
xc (Dense)                   (None, 11)                187       
=================================================================
Total params: 14,763
Trainable params: 14,667
Non-trainable params: 96
_________________________________________________________________
110000
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]
['8PSK', 'AM-DSB', 'AM-SSB', 'BPSK', 'CPFSK', 'GFSK', 'PAM4', 'QAM16', 'QAM64', 'QPSK', 'WBFM']
Train on 88011 samples, validate on 10989 samples
Epoch 1/100
 1024/88011 [..............................] - ETA: 3:59 - loss: 2.3979 - accuracy: 0.1016 2048/88011 [..............................] - ETA: 2:14 - loss: 2.3979 - accuracy: 0.1016 3072/88011 [>.............................] - ETA: 1:33 - loss: 2.3979 - accuracy: 0.0996 4096/88011 [>.............................] - ETA: 1:13 - loss: 2.3980 - accuracy: 0.0952 5120/88011 [>.............................] - ETA: 1:00 - loss: 2.3980 - accuracy: 0.0977 6144/88011 [=>............................] - ETA: 52s - loss: 2.3979 - accuracy: 0.0960  7168/88011 [=>............................] - ETA: 46s - loss: 2.3979 - accuracy: 0.0957 8192/88011 [=>............................] - ETA: 41s - loss: 2.3978 - accuracy: 0.0950 9216/88011 [==>...........................] - ETA: 38s - loss: 2.3982 - accuracy: 0.093310240/88011 [==>...........................] - ETA: 35s - loss: 2.3983 - accuracy: 0.092711264/88011 [==>...........................] - ETA: 32s - loss: 2.3982 - accuracy: 0.091412288/88011 [===>..........................] - ETA: 30s - loss: 2.3981 - accuracy: 0.091713312/88011 [===>..........................] - ETA: 29s - loss: 2.3981 - accuracy: 0.091814336/88011 [===>..........................] - ETA: 27s - loss: 2.3980 - accuracy: 0.093315360/88011 [====>.........................] - ETA: 26s - loss: 2.3979 - accuracy: 0.092316384/88011 [====>.........................] - ETA: 25s - loss: 2.3979 - accuracy: 0.092817408/88011 [====>.........................] - ETA: 23s - loss: 2.3978 - accuracy: 0.092118432/88011 [=====>........................] - ETA: 22s - loss: 2.3977 - accuracy: 0.092419456/88011 [=====>........................] - ETA: 22s - loss: 2.3977 - accuracy: 0.092420480/88011 [=====>........................] - ETA: 21s - loss: 2.3975 - accuracy: 0.092421504/88011 [======>.......................] - ETA: 20s - loss: 2.3972 - accuracy: 0.092922528/88011 [======>.......................] - ETA: 19s - loss: 2.3969 - accuracy: 0.092723552/88011 [=======>......................] - ETA: 19s - loss: 2.3965 - accuracy: 0.092624576/88011 [=======>......................] - ETA: 18s - loss: 2.3959 - accuracy: 0.092425600/88011 [=======>......................] - ETA: 18s - loss: 2.3952 - accuracy: 0.092426624/88011 [========>.....................] - ETA: 17s - loss: 2.3941 - accuracy: 0.092627648/88011 [========>.....................] - ETA: 17s - loss: 2.3930 - accuracy: 0.092728672/88011 [========>.....................] - ETA: 16s - loss: 2.3922 - accuracy: 0.093629696/88011 [=========>....................] - ETA: 16s - loss: 2.3912 - accuracy: 0.095430720/88011 [=========>....................] - ETA: 15s - loss: 2.3900 - accuracy: 0.097131744/88011 [=========>....................] - ETA: 15s - loss: 2.3887 - accuracy: 0.098532768/88011 [==========>...................] - ETA: 14s - loss: 2.3877 - accuracy: 0.099633792/88011 [==========>...................] - ETA: 14s - loss: 2.3863 - accuracy: 0.101834816/88011 [==========>...................] - ETA: 14s - loss: 2.3848 - accuracy: 0.103935840/88011 [===========>..................] - ETA: 13s - loss: 2.3828 - accuracy: 0.106236864/88011 [===========>..................] - ETA: 13s - loss: 2.3805 - accuracy: 0.108037888/88011 [===========>..................] - ETA: 13s - loss: 2.3785 - accuracy: 0.109138912/88011 [============>.................] - ETA: 12s - loss: 2.3759 - accuracy: 0.111139936/88011 [============>.................] - ETA: 12s - loss: 2.3734 - accuracy: 0.113240960/88011 [============>.................] - ETA: 12s - loss: 2.3701 - accuracy: 0.115341984/88011 [=============>................] - ETA: 11s - loss: 2.3664 - accuracy: 0.117343008/88011 [=============>................] - ETA: 11s - loss: 2.3628 - accuracy: 0.118644032/88011 [==============>...............] - ETA: 11s - loss: 2.3582 - accuracy: 0.120945056/88011 [==============>...............] - ETA: 10s - loss: 2.3539 - accuracy: 0.123146080/88011 [==============>...............] - ETA: 10s - loss: 2.3488 - accuracy: 0.125447104/88011 [===============>..............] - ETA: 10s - loss: 2.3437 - accuracy: 0.127848128/88011 [===============>..............] - ETA: 10s - loss: 2.3381 - accuracy: 0.130449152/88011 [===============>..............] - ETA: 9s - loss: 2.3312 - accuracy: 0.1333 50176/88011 [================>.............] - ETA: 9s - loss: 2.3242 - accuracy: 0.135951200/88011 [================>.............] - ETA: 9s - loss: 2.3183 - accuracy: 0.137752224/88011 [================>.............] - ETA: 8s - loss: 2.3112 - accuracy: 0.139753248/88011 [=================>............] - ETA: 8s - loss: 2.3036 - accuracy: 0.142154272/88011 [=================>............] - ETA: 8s - loss: 2.2971 - accuracy: 0.144355296/88011 [=================>............] - ETA: 8s - loss: 2.2900 - accuracy: 0.146856320/88011 [==================>...........] - ETA: 7s - loss: 2.2824 - accuracy: 0.149257344/88011 [==================>...........] - ETA: 7s - loss: 2.2767 - accuracy: 0.150958368/88011 [==================>...........] - ETA: 7s - loss: 2.2698 - accuracy: 0.153059392/88011 [===================>..........] - ETA: 6s - loss: 2.2635 - accuracy: 0.154860416/88011 [===================>..........] - ETA: 6s - loss: 2.2565 - accuracy: 0.157361440/88011 [===================>..........] - ETA: 6s - loss: 2.2501 - accuracy: 0.159662464/88011 [====================>.........] - ETA: 6s - loss: 2.2436 - accuracy: 0.162163488/88011 [====================>.........] - ETA: 5s - loss: 2.2376 - accuracy: 0.164164512/88011 [====================>.........] - ETA: 5s - loss: 2.2319 - accuracy: 0.166065536/88011 [=====================>........] - ETA: 5s - loss: 2.2253 - accuracy: 0.168366560/88011 [=====================>........] - ETA: 5s - loss: 2.2195 - accuracy: 0.169967584/88011 [======================>.......] - ETA: 4s - loss: 2.2142 - accuracy: 0.171568608/88011 [======================>.......] - ETA: 4s - loss: 2.2080 - accuracy: 0.173669632/88011 [======================>.......] - ETA: 4s - loss: 2.2031 - accuracy: 0.175770656/88011 [=======================>......] - ETA: 4s - loss: 2.1975 - accuracy: 0.177671680/88011 [=======================>......] - ETA: 3s - loss: 2.1916 - accuracy: 0.179572704/88011 [=======================>......] - ETA: 3s - loss: 2.1865 - accuracy: 0.1811