channels_last
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1, 128, 2)         0         
_________________________________________________________________
zero_padding2d (ZeroPadding2 (None, 1, 132, 2)         0         
_________________________________________________________________
conv2d (Conv2D)              (None, 1, 132, 256)       3328      
_________________________________________________________________
dropout (Dropout)            (None, 1, 132, 256)       0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 1, 136, 256)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 1, 136, 80)        122960    
_________________________________________________________________
dropout_1 (Dropout)          (None, 1, 136, 80)        0         
_________________________________________________________________
flatten (Flatten)            (None, 10880)             0         
_________________________________________________________________
dense1 (Dense)               (None, 256)               2785536   
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense2 (Dense)               (None, 11)                2827      
_________________________________________________________________
activation (Activation)      (None, 11)                0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 11)                0         
=================================================================
Total params: 2,914,651
Trainable params: 2,914,651
Non-trainable params: 0
_________________________________________________________________
channels_last
筛选后的数据集总数： 110000
信噪比范围: 0 到 18
调制方式 11 种: ['8PSK', 'AM-DSB', 'AM-SSB', 'BPSK', 'CPFSK', 'GFSK', 'PAM4', 'QAM16', 'QAM64', 'QPSK', 'WBFM']
Poisoned training data.
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 2, 128, 1)]       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 2, 128, 256)       4352      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 2, 64, 256)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 2, 64, 256)        0         
_________________________________________________________________
conv2 (Conv2D)               (None, 2, 64, 128)        524416    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 32, 128)        0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 2, 32, 128)        0         
_________________________________________________________________
conv3 (Conv2D)               (None, 2, 32, 64)         131136    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 2, 16, 64)         0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 2, 16, 64)         0         
_________________________________________________________________
conv4 (Conv2D)               (None, 2, 16, 64)         65600     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 8, 64)          0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 2, 8, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense1 (Dense)               (None, 128)               131200    
_________________________________________________________________
dense2 (Dense)               (None, 11)                1419      
=================================================================
Total params: 858,123
Trainable params: 858,123
Non-trainable params: 0
_________________________________________________________________
entropy_threshold: 0.7278801812617497
false_acceptance_rate: 0.01
Evaluate ASR on poisoned test data.
Abstained 186/11000 poison samples (1.69% TP rate)
Abstained 150/11000 clean samples (1.36% FP rate)
Repaired model eval

CA
snr: 0 acc: 0.8083889418493804
snr: 2 acc: 0.8389513108614233
snr: 4 acc: 0.8599118942731278
snr: 6 acc: 0.8475665748393021
snr: 8 acc: 0.8510822510822511
snr: 10 acc: 0.8339382940108893
snr: 12 acc: 0.8566275924256087
snr: 14 acc: 0.8572735590118938
snr: 16 acc: 0.8651892890120036
snr: 18 acc: 0.8818263205013429
acc_mean:  0.8500756027867222
ASR
snr: 0 acc: 0.34604385128693993
snr: 2 acc: 0.34737827715355807
snr: 4 acc: 0.35066079295154184
snr: 6 acc: 0.3654729109274564
snr: 8 acc: 0.3463203463203463
snr: 10 acc: 0.37295825771324864
snr: 12 acc: 0.34715960324616774
snr: 14 acc: 0.3806038426349497
snr: 16 acc: 0.3785780240073869
snr: 18 acc: 0.3366159355416294
acc_mean:  0.35717918417832245
time spend:  123.43353390693665 s
[0m